{
  "(1, 0, 2, 0, 0, 1, 0, 1, 0, 0, 0, 0)": "To set up the game, place every ball near the side table. The game involves placing a book on a desk and throwing a dodgeball so that it lands and stops moving on the desk. At the end of the game, your score is calculated by multiplying -4 with the number of times you've both placed a book on the desk and successfully thrown a dodgeball onto the desk.",
  "(1, 0, 2, 0, 1, 0, 0, 0, 0, 0, 0, 1)": "To set up the game, place a hexagonal bin near the door. The game involves throwing balls into the bin and ensuring objects are stationary and near the floor by the end of the game. Your score at the end of the game is calculated by multiplying -4 with the number of times you've successfully thrown a ball into the bin and the number of stationary objects near the floor.",
  "(1, 0, 2, 0, 0, 0, 1, 0, 0, 1, 0, 0)": "To set up the game, place a hexagonal bin near the west sliding door. The game involves placing an alarm clock inside the hexagonal bin and stacking two cube blocks on top of a cylindrical block. Your score at the end of the game is calculated by multiplying 20 by the number of times you've successfully stacked the blocks and placed the alarm clock in the bin.",
  "(1, 1, 2, 0, 0, 0, 0, 0, 1, 0, 0, 0)": "To play this game, pick up and release a green triangle block, then pick it up again and let it stop moving. Also, hold a ball and throw it so that it lands and stops moving on a hexagonal bin. Your score at the end of the game is calculated by multiplying 19 by the number of times you've satisfied both of these actions.",
  "(1, 1, 2, 2, 0, 0, 0, 0, 0, 0, 0, 0)": "To play this game, pick up a ball that is adjacent to you and throw it. The game ends after you've thrown a ball in this way at least once. Your score at the end of the game is 19 times the number of times you've thrown a ball.",
  "(1, 1, 2, 0, 0, 0, 0, 0, 0, 0, 1, 0)": "To play this game, throw balls with the aim of getting them to land either inside a hexagonal bin or on the bottom drawer. Your score at the end of the game is calculated by multiplying 7 with the number of successful throws into the bin and the number of successful throws onto the drawer.",
  "(1, 1, 2, 0, 0, 0, 0, 0, 0, 0, 0, 2)": "To play this game, move objects in the room so that they are stationary and near the center of the room. Additionally, while standing next to the side table, pick up and throw objects. The game ends when you decide to stop, and your score is the total number of objects that were moved to the center of the room and the total number of objects that were thrown from next to the side table.",
  "(1, 1, 2, 0, 1, 0, 0, 0, 0, 0, 1, 0)": "To play this game, throw balls into a hexagonal bin. There are two ways to score: first, by simply throwing a ball into the bin, and second, by throwing a different ball into the same bin and having it land on the bin. At the end of the game, your score is calculated by multiplying 70 by the number of times you've satisfied both of these conditions.",
  "(1, 0, 2, 1, 0, 0, 0, 0, 0, 1, 0, 0)": "To set up the game, place every ball near the bed. The game involves two main tasks: stacking blocks in a specific order and throwing balls. The first task is to stack a cube block on a cylindrical block, and then place a red pyramid block on top of both. The second task is to throw a ball and let it stop moving. At the end of the game, your score is calculated by multiplying 20 by the number of times you've successfully completed both tasks.",
  "(1, 1, 2, 0, 0, 0, 0, 1, 1, 0, 0, 0)": "To play this game, place a book on a desk and repeatedly pick up, release, and pick up again a green triangle block. Your score at the end of the game is calculated by multiplying 19 by the number of times you've completed the sequence with the green triangle block and the number of times a book is on the desk.",
  "(1, 1, 2, 0, 0, 0, 2, 0, 0, 0, 0, 0)": "To play this game, place game objects inside other game objects and inside the bottom drawer, ensuring they are not in motion and not being held by the agent at the end of the game. Your score is 80 times the number of objects that satisfy both these conditions.",
  "(1, 1, 2, 0, 0, 2, 0, 0, 0, 0, 0, 0)": "To play this game, throw dodgeballs onto either the desk or the floor. The game ends after you've thrown a dodgeball onto the floor at least 16 times. Your score at the end of the game is 19 times the number of successful throws onto both the desk and the floor.",
  "(1, 0, 2, 0, 1, 0, 0, 0, 0, 0, 1, 0)": "To set up the game, place a hexagonal bin on the floor. The game involves throwing balls and dodgeballs into the bin. You score when you successfully throw a ball or a dodgeball into the bin and it stops moving. The game ends when you've satisfied both conditions. Your final score is 40 times the number of successful throws you've made.",
  "(1, 0, 3, 0, 0, 0, 0, 0, 0, 0, 1, 2)": "To set up the game, place a hexagonal bin near the door. The game involves placing objects near the center of the room and near the door, and throwing balls into the hexagonal bin. All objects and balls must be stationary at the end of the game. Your score is calculated by multiplying -4 by the number of times each of these tasks has been completed.",
  "(1, 1, 3, 0, 0, 0, 0, 0, 3, 0, 0, 0)": "To play this game, you need to interact with three different blocks: a red pyramid block, a tall cylindrical block, and a green triangle block. For the red pyramid block, you need to pick it up, throw it, and let it stop moving. For the tall cylindrical block, you need to pick it up, release it, pick it up again, and let it stop moving. For the green triangle block, you need to pick it up, release it, and let it stop moving. At the end of the game, your score is 19 times the number of times you've completed each of these actions for each block.",
  "(1, 1, 3, 1, 0, 0, 0, 1, 0, 0, 0, 0)": "To play this game, place a book on a desk, throw a dodgeball, and throw a ball so that it lands on the bottom drawer. Your score at the end of the game is calculated by multiplying -6 with the number of times you've satisfied each of these actions.",
  "(1, 1, 3, 0, 0, 2, 1, 0, 0, 0, 0, 0)": "To play this game, throw balls with the aim of landing them on the bed or desk, and place objects inside the bottom drawer. The game ends when you decide to stop playing. Your score is calculated by multiplying -4 with the number of successful throws and objects placed in the drawer.",
  "(1, 1, 3, 0, 3, 0, 0, 0, 0, 0, 0, 0)": "To play this game, throw balls and dodgeballs into a hexagonal bin. The game has three preferences: \n1. Holding a ball, throwing it so it lands on the bin, and it ends up inside the bin.\n2. Holding a dodgeball, throwing it, and it ends up inside and on the bin.\n3. Holding a ball, throwing it so it lands on the bin, and it ends up inside the bin.\n\nAt the end of the game, your score is calculated by multiplying -4 with the number of times each of these preferences have been satisfied.",
  "(1, 1, 3, 0, 0, 0, 0, 0, 0, 1, 0, 0)": "To play this game, you need to throw balls onto specific targets and stack blocks in a particular order. First, throw a dodgeball so it lands on a hexagonal bin. Second, throw any ball so it lands on the bottom drawer. Finally, stack a cylindrical block, a regular block, and a red pyramid block in that order. The game ends when these preferences have been satisfied. Your score is calculated by multiplying -4 with the number of times each preference has been satisfied.",
  "(1, 1, 3, 0, 0, 0, 1, 0, 0, 1, 1, 0)": "To play this game, throw dodgeballs into a hexagonal bin, place a mug inside the same bin, and stack a blue cube block on top of two other blocks, with one of these blocks also stacked on top of the other. At the end of the game, your score is calculated by multiplying -8 by the number of times each of these tasks has been successfully completed.",
  "(1, 1, 3, 0, 0, 1, 0, 0, 0, 0, 0, 1)": "To play this game, hold and throw balls and other objects. Preference 1 is satisfied when a ball is thrown and lands on the bed. Preference 2 is satisfied when a ball is thrown while a block is adjacent to the player. Preference 3 is satisfied when any object is thrown while standing next to the bed. At the end of the game, your score is calculated by multiplying 20 by the number of times each preference has been satisfied.",
  "(1, 1, 3, 0, 1, 0, 0, 0, 1, 0, 0, 0)": "To play this game, you need to perform three actions: first, pick up a blue cube block, release it, and then pick it up again; second, throw a ball into a hexagonal bin; third, throw a dodgeball so it lands on a hexagonal bin. Your score at the end of the game is calculated by multiplying -4 with the number of times each of these actions has been successfully performed.",
  "(1, 0, 3, 2, 0, 0, 0, 1, 0, 0, 0, 0)": "To set up the game, place every ball near the bed. The game involves three tasks: placing a book on a desk, throwing any ball, and specifically throwing a blue dodgeball. At the end of the game, your score is calculated by multiplying 19 by the number of times each of these tasks has been completed.",
  "(1, 1, 4, 0, 0, 0, 0, 0, 0, 2, 2, 0)": "To play this game, you need to throw dodgeballs and stack blocks. Specifically, you need to throw a dodgeball so that it lands anywhere but inside a hexagonal bin, and throw a red dodgeball so that it lands inside a hexagonal bin. You also need to stack a red pyramid block on top of another block, which is itself on top of a cube block. Additionally, you need to stack a red pyramid block on top of both a block and a cylindrical block, with the block also on top of the cylindrical block. The game ends when you've satisfied these preferences. Your score is calculated by multiplying -10 with the number of times each preference has been satisfied.",
  "(1, 0, 4, 0, 1, 0, 0, 2, 0, 0, 0, 0)": "To set up the game, place a hexagonal bin near the center of the room. The game involves placing objects on the desk and on the bed, and throwing dodgeballs into and onto the hexagonal bin. The game ends when all these actions have been performed at least once. Your score is calculated by multiplying 19 by the number of times each of these actions has been successfully performed.",
  "(1, 1, 4, 0, 0, 1, 1, 0, 2, 0, 0, 0)": "To play this game, you need to interact with different objects. First, pick up a green triangle block, release it, then pick it up again and let it stop moving. Second, pick up a cylindrical block, throw it, and let it stop moving. Third, pick up a beachball, throw it, and make sure it lands and stops moving on the bed. Lastly, place any object inside the bottom drawer and make sure it stops moving. The game ends when you decide to stop playing. Your score is calculated by multiplying -4 with the number of times you've satisfied each of the four preferences.",
  "(1, 1, 4, 0, 0, 0, 0, 0, 0, 0, 0, 1)": "To play this game, you need to satisfy four preferences. First, ensure that an object is not in motion and is near the center of the room by the end of the game. Second, hold a white object, throw it, and make sure it lands and stops moving on the bed. Third, place a dodgeball inside a hexagonal bin by the end of the game. Lastly, hold a dodgeball, throw it, and ensure it lands and stops moving on a hexagonal bin. Your score at the end of the game is calculated by multiplying -6 with the number of times each of these four preferences have been satisfied.",
  "(1, 0, 4, 1, 0, 0, 0, 0, 0, 0, 0, 0)": "To set up the game, place a hexagonal bin on the floor. The game involves throwing different types of balls. You can throw a dodgeball or a golfball aiming for it to land on the hexagonal bin, or any ball aiming for it to land on the bottom drawer. The game ends when you decide to stop throwing balls. Your score is calculated by multiplying -4 by the total number of successful throws you made according to the preferences.",
  "(1, 0, 4, 0, 1, 0, 0, 1, 0, 2, 0, 0)": "To set up the game, place a hexagonal bin near the center of the room. The game involves throwing dodgeballs into the bin, placing objects on the bed, and stacking blocks in specific configurations. Specifically, a yellow pyramid block and a red pyramid block should both be on a cylindrical block, and a cube block and a red pyramid block should be stacked on a cylindrical block with the red pyramid block on top of the cube block. At the end of the game, your score is calculated by multiplying -2 with the number of times each of these tasks has been completed.",
  "(1, 1, 4, 0, 0, 1, 0, 0, 0, 0, 1, 0)": "To play this game, throw balls onto different objects. Specifically, throw a dodgeball onto a hexagonal bin, any ball onto a desk, any ball onto a bottom drawer, and any ball into a hexagonal bin. At the end of the game, your score is calculated by multiplying -4 with the number of successful throws you made for each of these four tasks.",
  "(1, 1, 4, 1, 0, 0, 0, 0, 0, 0, 0, 2)": "To play this game, throw balls with the aim of landing them on a hexagonal bin. You can also move objects in the room so that they are stationary and located near the center of the room or near the floor. Your score at the end of the game is calculated by multiplying 0.7 with the number of successful ball throws and the number of objects that are stationary and located near the center of the room or the floor.",
  "(1, 1, 4, 0, 0, 0, 0, 0, 1, 0, 0, 0)": "To play this game, you need to perform several actions. First, pick up a cube block, release it, and then pick it up again. Second, hold a dodgeball and throw it so that it lands on a hexagonal bin. By the end of the game, ensure that a ball is inside a hexagonal bin and that a cube block and a red pyramid block are both on a cylindrical block, which you should not be holding. Your score at the end of the game is 19 times the number of times each of these actions has been successfully performed.",
  "(1, 1, 4, 0, 0, 0, 0, 0, 0, 0, 0, 0)": "To play this game, throw balls with the aim of landing them on the bottom drawer, on a hexagonal bin, or anywhere else that's not the bottom drawer. Additionally, try to get a ball inside the hexagonal bin by the end of the game. Your score at the end of the game is calculated by multiplying 19 by the number of successful throws that satisfy each of these conditions."
}
